# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'gh' # GitHub command-line tool
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'stripe/stripe-cli/stripe'
brew 'svn'

# Development
cask 'dbeaver-community' # Universal database tool and SQL client
brew 'graphql-cli'
cask 'graphql-playground'
brew 'mysql'
brew 'sqlite'
brew 'nginx'
brew 'node'
brew 'postgresql@14'
cask 'postico'
brew 'redis'
brew 'yarn'
cask 'postgres-unofficial' # app wrapper for postgres
cask 'electron-fiddle'  # Electron experiments/playground
cask 'surge'

# Apps
cask 'anaconda'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'grammarly-desktop'
cask 'libreoffice'
cask 'notion'
brew 'nvm'
cask 'postman'
cask 'slack'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'whatsapp'
cask 'zoom'
# cask 'wordpresscom'
cask 'chrome-remote-desktop-host'  # Installer
cask 'raspberry-pi-imager'
cask 'imageoptim'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#   id - found in app store URL:
#     https://apps.apple.com/us/app/ooooo/id{$id}?mt=12
mas 'Giphy Capture', id: 668208984
mas 'Speedtest', id: 1153157709
mas 'Ooooo', id: 1482773008
mas 'Solar App', id: 450545814
# mas 'Multi Monitor Wallpaper', id: 504284434
mas 'Clockify Desktop', id: id1364502317