# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh' # GitHub command-line tool
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

brew 'gifsicle'

# Development
brew 'composer'
brew 'dbeaverultimate' # Universal database tool and SQL client
brew 'graphql-cli'
brew 'graphql-playground' #GraphQL IDE for better development workflows
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
cask 'postgresql@13'
cask 'postico' # GUI client for PostgreSQL databases
brew 'redis'
brew 'yarn'

# Apps
cask 'anaconda'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'grammarly-desktop'
brew 'libreoffice'
brew 'notion'
cask 'nvm'
cask 'postman'
cask 'slack'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
#   id - found in app store URL:
#     https://apps.apple.com/us/app/ooooo/id{$id}?mt=12
mas 'Giphy Capture', id: 668208984
mas 'Speedtest', id: 1153157709
mas 'Ooooo', id: 1482773008
mas 'Solar App', id: 450545814
mas 'Multi Monitor Wallpaper', id: 504284434